# WoodRaySegLengthZ Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedWood..::..WoodRaySegLengthZ Property
AdvancedWood Class See Also
---
The property labeled "Length (cm) of z segment containing one ray" from the "AdvancedWood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WoodRaySegLengthZ { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WoodRaySegLengthZ As String
	Get
```

Visual C++
---
```text
public:
static property String^ WoodRaySegLengthZ {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDistance".
# See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace